{"pageProps":{"post":{"slug":"bucket-versioning","category":{"slug":"aws","title":"AWS crump","excerpt":"Place for topics related to AWS","coverImage":"/assets/logo.png","content":"","top":true},"title":"How to burn money with S3","excerpt":"S3 Bucket versioning is one of the best features provided by AWS it's also one of the best ways to burn your budget","coverImage":"/assets/s3/bucket-versioning/title_cover.png","cardImage":"/assets/s3/bucket-versioning/title_card.png","date":"2022-10-10T12:36:35.000Z","contentPath":"/aws/bucket-versioning.md","content":"<h2>S3 bucket versioning - budget burner</h2>\n<p>This is how AWS presents bucket versioning.</p>\n<blockquote>\n<p>Versioning in Amazon S3 is a means of keeping multiple variants of an object in the same bucket. You can use the S3 Versioning feature to preserve, retrieve, and restore every version of every object stored in your buckets.</p>\n</blockquote>\n<p>A key point here <strong>is a means of keeping multiple variants of an object</strong>  as you know for each object stored in S3 you need to pay $0.023 GB / month.</p>\n<blockquote>\n<p>It might look like a small price, however, if you are using S3 as data lake storage - you not talking gigabytes anymore. Right!</p>\n</blockquote>\n<p>Let me run an experiment so you would not have to!</p>\n<h2>enable bucketing</h2>\n<p>Bucket versioning is enabled when you are creating a bucket. You can also enable versioning under the properties of a created bucket.</p>\n<p><img src=\"/assets/s3/bucket-versioning/versioning.png\" alt=\"creat bucket\"></p>\n<h2>working with versioning</h2>\n<p>A bucket with versioning enabled is not anyhow different from a bucket without it. So you might not even know if the bucket has versioning enabled or not at first glance.</p>\n<h3>object upload</h3>\n<p>Let's say we have the following object</p>\n<p><img src=\"/assets/s3/bucket-versioning/gang.png\" alt=\"my gang\"></p>\n<p>Let's upload this object to the object store multiple times and see how it works.</p>\n<p><img src=\"/assets/s3/bucket-versioning/copy_objects.png\" alt=\"my gang\"></p>\n<p>As you see I have uploaded this object twice however I only see single object in S3. Great!</p>\n<h3>deleteing objects</h3>\n<p>Let's say we decided to delete our object because we do not need it anymore:</p>\n<p><img src=\"/assets/s3/bucket-versioning/delete.png\" alt=\"s3 console\"></p>\n<p>Let's check the S3 console\n<img src=\"/assets/s3/bucket-versioning/delete_console_3.png\" alt=\"s3 console\"></p>\n<p>If you stop here you might think this is great! Don't forget amazon promised to keep all the versions... so if you toggle <strong>Show versions</strong> you will see all your objects are still in the bucket event the one you have deleted.</p>\n<p><img src=\"/assets/s3/bucket-versioning/delete_console_2.png\" alt=\"s3 console\"></p>\n<blockquote>\n<p>This is expected behavior it's definitely not an issue.</p>\n</blockquote>\n<p>In my opinion, it is very easy to miss deleted objects which could lead to an increase in your storage and eventually cost. We pay for all the storage we used in S3.</p>\n<h2>how to check if you have this issue</h2>\n<p>In the real world, it might be tricky to see all the object versions inside a bucket. So how would one find these hidden objects?</p>\n<h3>storage Lens</h3>\n<p>Storage Lens - is a service from AWS which collects statistical information about your bucket, and in my experience, this is one of the best ways to identify problematic buckets.</p>\n<p>Go to your buckets and you will see <strong>Account Snapshot</strong> on the right side there will be a button <strong>View Storage Lens dashboard</strong>\n<img src=\"/assets/s3/bucket-versioning/account_snapshot.png\" alt=\"storage lens\"></p>\n<p>In the dashboard select <strong>Bucket</strong>\n<img src=\"/assets/s3/bucket-versioning/dashboard_1.png\" alt=\"my gang\"></p>\n<p>Scroll down to bucket list and instead os summary select <strong>Cost efficiency</strong></p>\n<p><img src=\"/assets/s3/bucket-versioning/cost_efficiency.png\" alt=\"my gang\"></p>\n<p>Here you will see all your buckets, metric you are looking for is: <strong>Noncurrent version bytes</strong> if this metric is more than zero you might be having some old data hiding around.</p>\n<p>As you can see in my case my bucket is using 6MB of current and 6 times more (36MB) noncurrent objects. I would be paying for a total of 42MB of storage.</p>\n<h2>cleaning data, handling your budget</h2>\n<p>Once again AWS is doing what it promised to do by saving all the versions of your data in a bucket.</p>\n<p>I think you will agree with me very often we do not need to keep all the versions of an object, I do see some use cases then we must keep all the versions however my \"gang\" isn't one of these things :)</p>\n<h3>lifecycle policy</h3>\n<p>Let's update the lifecycle policy to remove all the object which was deleted and only keep a single version (in case we would need to restore)</p>\n<p>So to delete noncurrent version objects you need to select an option: <strong>Permanently delete noncurrent versions of objects</strong> and specify the number of days after how much you would like to delete noncurrent objects also you can optionally specify the number of versions you would like to keep.</p>\n<p>My setup: delete all noncurrent version objects after 1 day (minimum) and keep a single object.</p>\n<p><img src=\"/assets/s3/bucket-versioning/lifecycle_1.png\" alt=\"my gang\">\n<img src=\"/assets/s3/bucket-versioning/lifecycle_2.png\" alt=\"my gang\"></p>\n<p>It takes time (up to 24h) for the lifecycle policy to trigger, however after some time final result is.</p>\n<p>I still have deleted objects (because I asked for 1 version to be kept) this way my storage cost for S3 will not grow unexpectedly.</p>\n<p><img src=\"/assets/s3/bucket-versioning/whats_left.png\" alt=\"my gang\"></p>\n<h2>summary</h2>\n<p>Bucket versioning is a powerful feature. If you need to keep all versions of the data this feature will save hours of development work.</p>\n<p>If you need to use this feature gor for it, however as always think what should be your data retention policies.</p>\n<p>Rule of thumb:\nCreate a lifecycle policy the moment you are creating bucket - this way you will not need to worry about unexpected costs.</p>","top":true,"visible":true,"tags":[{"slug":"s3","title":"AWS S3","excerpt":"","coverImage":"/assets/logo.png","content":""},{"slug":"aws","title":"AWS","excerpt":"","coverImage":"/assets/logo.png","content":""},{"slug":"budget","title":"Budget","excerpt":"","coverImage":"/assets/logo.png","content":""}]},"category":{"slug":"aws","title":"AWS crump","excerpt":"Place for topics related to AWS","coverImage":"/assets/logo.png","content":"","top":true},"posts":[]},"__N_SSG":true}