{"pageProps":{"post":{"slug":"prologue","category":{"slug":"data-ocean","title":"Data Ocean","excerpt":"In a world of data lakes, data rivers - we need something new let it be data ocean :) ","coverImage":"/assets/logo.png","content":"","top":true},"title":"Data Ocean: Prologue","excerpt":"Data platform on Digital Ocean infrastructure. How hard could it be to build it from scratch","coverImage":"/assets/data-ocean/prologue/cover.png","cardImage":"/assets/data-ocean/prologue/card.png","date":"2022-10-22T24:36:35.000Z","contentPath":"/data-ocean/prologue.md","content":"<h2>real reason for blog</h2>\n<p>Before starting this blog, first I came up with this project. Initially, my idea was to put each step of the project as a Medium or LinkedIn post however I decided to move with a custom blog.</p>\n<h2>what kind project</h2>\n<p>I always try to put myself out of my comfort zone - this way I can learn new skills and practices. Most important I get first-hand experience by trying instead of relying upon something I read.</p>\n<p><a rel=\"nofollow\" href=\"https://www.linkedin.com/in/scgupta/\">Satish Chandra Gupta</a> have wrote article in which he presented this diagram</p>\n<p><img src=\"/assets/data-ocean/prologue/providers.png\" alt=\"providers\"></p>\n<p>I'm pretty sure you have already seen it. This diagram shows how each provider has its own unique service to create a data platform.</p>\n<p>AWS, Google Cloud, and Azure have the readiest services for data platforms. Azure and Google use their own solutions, AWS sometimes uses open-source projects as the backbone of their managed services.</p>\n<p>There is a lot of information and ideas on how to build the best data platform using these providers.</p>\n<p>My project is a Data platform built on top of Digital Ocean infrastructure.</p>\n<h2>choosing name</h2>\n<p>Digital Ocean + Data Platform:</p>\n<ul>\n<li>Digital Data / Data Digital</li>\n<li>Digital Platform / Platform Digital</li>\n<li>Ocean Data / Data ocean</li>\n<li>Ocean Platform / Platform Ocean</li>\n</ul>\n<blockquote>\n<p>I have heard term data river having in mind data streams.</p>\n</blockquote>\n<p>So clear winner for this was Data ocean</p>\n<blockquote>\n<p>It has data and a water element in the name :) I am still not sure why data engineers is so obsessed with water</p>\n</blockquote>\n<h2>data ocean</h2>\n<p>I will use the infrastructure of Digital Ocean with a combination of open-source projects to make it work. I'm planning on implementing the following.</p>\n<p><img src=\"/assets/data-ocean/prologue/diagram.png\" alt=\"diagram\"></p>\n<p>I do not have a clear plan for each of these pieces, so if you have some ideas, leave your comment on social media.</p>\n<h2>summary</h2>\n<p>I'm very hyped about this project I think it will be enjoyable to execute and also I should learn a ton!!!</p>\n<p>If my dear reader you have some requirements or suggestions or applications please don't hesitate and share them on social media.</p>","top":true,"visible":true,"tags":[{"slug":"data","title":"Data","excerpt":"","coverImage":"/assets/logo.png","content":""}]},"category":{"slug":"data-ocean","title":"Data Ocean","excerpt":"In a world of data lakes, data rivers - we need something new let it be data ocean :) ","coverImage":"/assets/logo.png","content":"","top":true},"posts":[]},"__N_SSG":true}