{"pageProps":{"post":{"slug":"storage","category":{"slug":"basics","title":"Basics","excerpt":"Basic stuff which you already know","coverImage":"/assets/logo.png","content":"","top":true},"title":"Object vs block store","excerpt":"Cheap, scalable, and yet is it really the best storage type for your next big data project","coverImage":"/assets/basics/storage/storage_cover.png","cardImage":"/assets/basics/storage/storage_card.png","date":"2022-10-13T12:36:35.000Z","contentPath":"/basics/storage.md","content":"<h2>what is</h2>\n<h3>object storage</h3>\n<p>AWS simple storage service (S3) - is the best know object-store. However, it’s not the only provider of object storage, other choices:</p>\n<ul>\n<li>Azure Blob storage</li>\n<li>Google cloud storage (GCS)</li>\n<li>DigitalOcean spaces</li>\n</ul>\n<blockquote>\n<p>search for object store providers you might have found one in your home town :)</p>\n</blockquote>\n<h3>block storage</h3>\n<p>I think the easiest way to think about block storage - it's an HDD or SSD or NVRAM which you can attach to your running instance in the cloud. Each cloud provider does have a version of it.</p>\n<h2>usage</h2>\n<p>If your project is Netflix, Spotify, or a book library - in which your objects need to be returned to the user full - object store might be a perfect solution.</p>\n<h3>object store for database</h3>\n<blockquote>\n<p>amount of data you need to read is directly responsible for your database performance</p>\n</blockquote>\n<p>The parquet file is split into row groups which contain columns and meta information about it. Readers are expected to first read the file metadata to find all the column chunks they are interested in. The column chunks should then be read sequentially. The format is explicitly designed to separate the metadata from the data.</p>\n<p>However to achieve this storage needs to support the ability to read chunks of files, this is easily achievable in block storage because the operating system supports this.</p>\n<p>Object storage on the other hand returns all or nothing for a given key. In S3 there is a way to seek, however HTTP protocol is not as fast as direct access storage provided by the operating system.</p>\n<p>At least right now many databases which are based on object storage - first need to download a file to local storage (block storage) and then process it the same way.</p>\n<p>Of course, this is not the case if your files are JSON or CSV. The computation engine needs to read a full file to be able to parse information from it. If you need to read the full file object store is a very good solution.</p>\n<h2>which one to chooce</h2>\n<p>for near realtime data retrieval - block storage</p>\n<p>for data lake or unstructured data - object store</p>\n<h2>additional info</h2>\n<h3>pricing</h3>\n<p>Block storage at a minimum twice expensive compared to object-store.</p>\n<table>\n<thead>\n<tr>\n<th>Type</th>\n<th>Product</th>\n<th>Price per TB / month</th>\n</tr>\n</thead>\n<tbody>\n<tr>\n<td>Object</td>\n<td>AWS S3</td>\n<td>around $23</td>\n</tr>\n<tr>\n<td>Object</td>\n<td>GCS</td>\n<td>around $23</td>\n</tr>\n<tr>\n<td>Block</td>\n<td>EBS</td>\n<td>starts at $80</td>\n</tr>\n<tr>\n<td>Block</td>\n<td>Google Disk</td>\n<td>starts at $44</td>\n</tr>\n</tbody>\n</table>\n<h3>access layer</h3>\n<p>Object sore - HTTP protocol</p>\n<p>Block storage - operating system</p>\n<h2>summary</h2>\n<p>Both object and block storage has it's use cases and very often you will need to go with a mixture of both</p>\n<blockquote>\n<p>what fits everything very often doesn't fit anything</p>\n</blockquote>\n","top":true,"visible":true,"tags":[{"slug":"aws","title":"AWS","excerpt":"","coverImage":"/assets/logo.png","content":""},{"slug":"storage","title":"Storage","excerpt":"","coverImage":"/assets/logo.png","content":""}]},"category":{"slug":"basics","title":"Basics","excerpt":"Basic stuff which you already know","coverImage":"/assets/logo.png","content":"","top":true},"posts":[]},"__N_SSG":true}